Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Remember to include a linefeed (`n) or carriage return and linefeed (`r`n) after the text, if desired.
ja: 必要であれば、テキストの後にラインフィード（`n）またはキャリッジリターンとラインフィード（`r`n）を含めることを忘れないようにしてください。

source: Remove # to make the hotkey activate whenever you press N on its own.
ja: #を削除するとNを単独で押したときにホットキーが有効になります。

source: Remove all files and subdirectories (like the Windows command "rmdir /S").
ja: すべてのファイルとサブディレクトリを削除する（Windowsのコマンド"rmdir /S"のように）。

source: Remove an item using the Delete method:
ja: Deleteメソッドを使用して項目を削除します：

source: Remove an item using the RemoveAt method:
ja: RemoveAtメソッドを使用して項目を削除します：

source: Remove the active window from the taskbar for 3 seconds.
ja: アクティブなウィンドウを3秒間タスクバーから削除します。

source: Remove the last item using the Pop method:
ja: Popメソッドを使って最後の項目を削除する：

source: RemoveAt is the counterpart of InsertAt.
ja: RemoveAtはInsertAtの対になるものです。

source: RemoveAt method
ja: RemoveAtメソッド

source: Removed
ja: 削除

source: Removed "command syntax".
ja: 「コマンドシンタックス」の廃止。

source: Removed EventInfo parameter (use a closure or bound function instead).
ja: EventInfoパラメータを削除しました（代わりにクロージャまたはバウンド関数を使用します）。

source: Removed Commands, Functions & Directives
ja: 削除されたコマンド、関数、指令

source: Removed all legacy If statements, leaving only if expression, which never requires parentheses (but allows them, as in any expression).
ja: 従来のIf文がすべて廃止され、if expressionのみを残し、括弧を必要としません（ただし、あらゆる式と同様に括弧を使用できる）ようにしました。

source: Removed an optimization for return var which caused the variable to appear blank when accessed within a finally block.
ja: finallyブロック内でアクセスすると変数が空白に表示される原因となっていたreturn varの最適化を削除しました。

source: Removed legacy mixer component types.
ja: レガシーミキサーコンポーネントタイプを削除しました。

source: Removed literal assignments:
ja: リテラルの割り当てが廃止されました：

source: Removed literal assignments: var = value
ja: リテラルの割り当てが廃止されました：var = value

source: Removed the Label parameter and related functionality.
ja: Labelパラメータと関連する機能を削除しました。

source: Removed the special behaviour of variadic callback functions and added the & option (pass the address of the parameter list).
ja: 可変型コールバック関数の特殊な挙動を削除し、&オプション（パラメータリストのアドレスを渡す）を追加しました。

source: Removed unsupported control types.
ja: サポートされていないコントロールタイプを削除しました。

source: Removed:
ja: 削除：

source: Removes a key-value pair from a map.
ja: マップからキーとバリューのペアを削除します。

source: Removes all CR-LF pairs from the clipboard contents.
ja: クリップボードの内容からすべてのCR-LFペアを削除する。

source: Removes all blank lines from the text in a variable.
ja: 変数内のテキストからすべての空行を削除する。

source: Removes all key-value pairs from a map.
ja: マップからすべてのキーとバリューのペアを削除します。

source: Removes an own property from an object.
ja: オブジェクトから自身のプロパティを削除する。

source: Removes and returns the last array element.
ja: 配列の最後の要素を削除して返します。

source: Removes any of the options following the -, up to the next +.
ja: -に続くオプションのうち、次の+まで削除します。

source: Removes items from an array.
ja: 配列から項目を削除します。

source: Removes the active window from the taskbar for 3 seconds.
ja: アクティブなウィンドウを3秒間、タスクバーから削除します。

source: Removes the active window's title bar (WS_CAPTION).
ja: アクティブウィンドウのタイトルバー(WS_CAPTION)を削除します。

source: Removes the checkmark (if there is one) from a menu item.
ja: メニュー項目からチェックマーク（ある場合）を削除します。

source: Removes the directory including its files and subdirectories.
ja: ファイルやサブディレクトリを含むディレクトリを削除します。

source: Removes the directory, but only if it is empty.
ja: ディレクトリを削除します。ただし、ディレクトリが空の場合のみです。

source: Removes the value of an array element, leaving the index without a value.
ja: 配列の要素の値を削除し、インデックスに値を残さないようにします。

source: Removes the window and all its controls, freeing the corresponding memory and system resources.
ja: ウィンドウとそのすべてのコントロールを削除し、対応するメモリとシステムリソースを解放します。

source: Removing an option by VK number does not affect any options that were set by SC, or vice versa.
ja: VK番号でオプションを削除しても、SCで設定されていたオプションには影響しませんし、その逆も同様です。

source: Rename the directory rather than moving it.
ja: ディレクトリを移動するのではなく、名前を変更します。

source: Renamed Commands, Functions & Directives
ja: 名前が変わったコマンド、関数、指令

source: Renamed the Start menu shortcut from "AutoHotkey" to "AutoHotkey Dash".
ja: スタートメニューのショートカットの名前を「AutoHotkey」から「AutoHotkey Dash」に変更しました。

source: Renamed:
ja: 改名：

source: Renames MenuItemName to NewName.
ja: MenuItemNameの名前をNewNameに変更します。

source: Renames a menu item.
ja: メニュー項目の名前を変更します。

source: Renames a single file.
ja: 1つのファイルの名前を変更します。

source: Renaming AutoHotkey.exe also changes which script it runs by default, which can be an alternative to compiling a script for use on a computer without AutoHotkey installed.
ja: AutoHotkey.exeの名前を変更すると、デフォルトで実行されるスクリプトも変更されます。これは、AutoHotkeyがインストールされていないコンピュータで使用するためにスクリプトをコンパイルする代わりになります。

source: Repeating or Holding Down a Key
ja: 鍵盤の繰り返しや長押し

source: Repeats a series of functions once for each key-value pair in an object.
ja: オブジェクトのキーとバリューのペアごとに、一連の関数を1回ずつ繰り返します。

source: Replace 80 with -1 to autosize the column.
ja: 80を-1に置き換えると、カラムのサイズが自動化されます。

source: Replace # with <^ to make it activate only when the left Ctrl key is pressed, or >^ for the right Ctrl key, or both to require both keys.
ja: #を<^に置き換えると、左Ctrlキーが押されたときだけ有効になり、>^に置き換えると右Ctrlキーが押されたときだけ有効になり、両方のCtrlキーが必要なときは両方となります。

source: Replace # with ^ for Ctrl, ! for Alt or + for Shift, or try combinations.
ja: #を、Ctrlの^、Altの!、Shiftの+に置き換えたり、組み合わせを試したりしてください。

source: Replace WinActive with WinExist so that the hotkeys activate if Notepad is running, even if Notepad doesn't have the focus.
ja: WinActiveを WinExistに置き換えて、メモ帳が起動していれば、メモ帳にフォーカスがなくても、ホットキーが有効になるようにしました。

source: Replace `r`n with `n when reading and `n with `r`n when writing.
ja: 読むときは`r`nを`nに、書くときは`nを`r`nに置き換えてください。

source: Replace n with any name from the key list.
ja: nを キーリストの任意の名前に置き換えてください。

source: Replace n with any other letter or symbol (except :).
ja: nを他の文字や記号（:を除く）に置き換えてください。

source: Replace 123 with a number that is at least as large as the size of the structure, in bytes.
ja: 123を構造体のサイズと同じ大きさ以上の数値（バイト数）に置き換えてください。

source: Replace 123 with the integer to be put into the target member (or specify StrPtr(Var) to store the address of a string).
ja: 123をターゲットメンバに入れる整数に置き換えます（文字列のアドレスを格納する場合はStrPtr(Var)を指定します）。

source: Replace 4 with the offset of the target member in the structure.
ja: 4を構造体内の対象メンバーのオフセットに置き換える。

source: Replace "UInt" with the appropriate type or omit it if the member is a pointer or handle.
ja: "UInt"を適切な型に置き換えるか、メンバーがポインタまたはハンドルである場合は省略します。

source: Replace 4 with the offset of the target member (see step #4 for description of "offset").
ja: 4を対象部材のオフセットに置き換える（「オフセット」の説明については手順4参照）。

source: Replace "UInt" with the appropriate type, such as "Ptr" if the member is a pointer or handle.
ja: "UInt"を適切な型（メンバーがポインタまたはハンドルの場合は"Ptr"など）に置き換える。

source: Replace BitmapHandle or IconHandle with the actual handle value.
ja: BitmapHandleまたはIconHandleを実際のハンドル値に置き換える。

source: Replace bitmap-handle or icon-handle with the actual handle value.
ja: bitmap-handleまたはicon-handleを実際のハンドル値に置き換える。

source: Replace n with the menu item's thread priority, e.g. P1.
ja: nをメニュー項目のスレッド優先度に置き換えます（例：P1）。

source: Replace Color with a color name (see color chart) or RGB value (the 0x prefix is optional).
ja: Colorを色名（カラーチャート参照）またはRGB値（0x接頭辞は任意）に置き換える。

source: Replace it with -2 to do the same but also take into account the header text width.
ja: これを-2に置き換えると、同じようになりますが、ヘッダーテキストの幅も考慮されます。

source: Replace standalone `r with `n when reading.
ja: 読み取り時にスタンドアロンの`rを`nに置き換える。

source: Replace the condition with GetKeyState("CapsLock", "T") so that the hotkeys only activate while CapsLock is on.
ja: 条件をGetKeyState("CapsLock", "T")に置き換え、CapsLockがオンになっている間だけホットキーが有効になるようにします。

source: Replaced Next() with Call(), with the same usage except that ByRef works differently now; for instance, a method defined as Call(&a) should assign a := next_value while Call(a) would receive a VarRef, so should assign %a% := next_value.
ja: Next()をCall()に置き換え、ByRefが異なる動作をする以外は同じ使い方をします。例えば、Call(&a)として定義されたメソッドはa := next_valueを代入する必要がありますが、Call(a)はVarRefを受け取るので%a% := next_valueを代入すべきです。

source: Replaced _NewEnum() with __Enum(n).
ja: NewEnum()を__Enum(n)に置き換えました。

source: Replaces all occurrences of ABC with DEF (also converts the clipboard to plain text).
ja: ABCをDEFに置き換えます（クリップボードもプレーンテキストに変換します）。

source: Replaces all spaces with pluses.
ja: すべてのスペースをプラスに置き換える。

source: Replaces any/all occurrences of carriage return & linefeed (`r`n) with linefeed (`n).
ja: キャリッジリターンとラインフィード(`r`n)をラインフィード(`n)に置き換える。

source: Replaces occurrences of a pattern (regular expression) inside a string.
ja: 文字列の中にあるパターン（正規表現）の出現箇所を置き換えます。

source: Replaces the currently running instance of the script with a new one.
ja: 現在実行中のスクリプトのインスタンスを新しいものに置き換えます。

source: Replaces the specified substring with a new string.
ja: 指定された部分文字列を新しい文字列で置き換えます。

source: Replacing Call with static Call would instead override what occurs when YourClassName itself is called.
ja: Callを static Callに置き換えると、代わりにYourClassName自身が呼び出されたときに起こることがオーバーライドされる。

source: Report (default), Icon, Tile, IconSmall, and List.
ja: Report（デフォルト）、Icon、Tile、IconSmall、List。

source: Report False-Positives To Anti-Virus Companies
ja: アンチウイルス会社に偽陽性を報告します

source: Reports "123" because a match was achieved via the case-insensitive option.
ja: 大文字小文字を区別しないオプションで一致したため、「123」を報告します。

source: Reports "Target label exists" because the label does exist.
ja: ラベルが存在するため、「対象ラベルが存在します」と報告する。

source: Reports "This is an object." because the value is an object.
ja: 値がオブジェクトであるため、「This is an object.」と報告する。

source: Reports "aaaXYZzzz" by means of the $1 backreference.
ja: $1バックリファレンスによって「aaaXYZzzz」を報告する。

source: Reports "abc123xyz" because the $ allows a match only at the end.
ja: 「abc123xyz」を報告するのは、$が末尾にのみマッチングを許可しているからです。

source: Reports 1 and stores "XYZ" in SubPat[1].
ja: 1を報告し、SubPat[1]に「XYZ」を格納する。

source: Reports 1 because a match was achieved via the case-insensitive option.
ja: 大文字小文字を区別しないオプションで一致したため、1を報告します。

source: Reports 4, which is the position where the match was found.
ja: 一致した位置である4を報告する。

source: Reports 7 because the $ requires the match to be at the end.
ja: 7を報告するのは、＄がマッチを最後にすることを要求しているからです。

source: Reports 7 instead of 1 due to the starting position 2 instead of 1.
ja: スタート位置が1ではなく2のため、1ではなく7を報告する。

source: Reports a multi-line string.
ja: 複数行の文字列を報告する。

source: Reports an empty string and stores 2 in ReplacementCount.
ja: 空文字列を報告し、ReplacementCountに2を格納します。

source: Reports the 1-based position of the substring "abc" in the string "123abc789".
ja: 文字列「123abc789」中の部分文字列「abc」の1基準の位置を報告する。

source: Reports the HWND and ClassNN of the active window's focused control.
ja: アクティブウィンドウのフォーカスコントロールのHWNDとClassNNを報告します。

source: Reports the full path of each text file located in a directory and in its subdirectories.
ja: ディレクトリとそのサブディレクトリにある各テキストファイルのフルパスを表示します。

source: Reports the number of items in a menu and the ID of the last item.
ja: メニューの項目数と最後の項目のIDを報告します。

source: Reports the position of the mouse cursor.
ja: マウスカーソルの位置を報告します。

source: Reports the string corresponding to the character code 116.
ja: 文字コード 116 に対応する文字列を報告します。

source: Reports various type information of a COM object.
ja: COMオブジェクトの各種型情報を報告します。

source: Reports whether a file or folder is read-only, hidden, etc.
ja: ファイルやフォルダーが読み取り専用かどうか、非表示かどうかなどを報告します。

source: Represents a call to the function What.
ja: 関数Whatの呼び出しを表します。

source: Represents a user-defined or built-in function and provides an interface to call it, bind parameters to it, and retrieve information about it or its parameters.
ja: ユーザー定義または組み込み関数を表し、それを呼び出し、パラメータをバインドし、それやそのパラメータに関する情報を取得するためのインターフェースを提供します。

source: Represents a user-defined or built-in function.
ja: ユーザー定義関数または組込み関数を表します。

source: Represents the launching of a thread, typically the direct cause of the function call above it.
ja: スレッドの起動を表し、通常、その上の関数呼び出しの直接の原因となるものです。

source: Requirements:
ja: 必要条件

source: Requirements: Winspector Spy (can be found here)
ja: 必要条件：Winspector Spy（ここにある）

source: Resizes the window to accommodate only its currently visible controls.
ja: 現在表示されているコントロールのみを収容するためにウィンドウのサイズを変更します。

source: Resolves relative components such as \.. and \..
ja: \.. や \. のような相対コンポーネントを解決する。

source: Resolves relative paths such as dir\file.ext, \file.ext and C:file.ext (note the absence of a slash).
ja: dir\file.ext, \file.ext, C:file.ext のような相対パスを解決する（スラッシュがないことに注意）。

source: Respond to signals from hand-held remote controls via the WinLIRC client script.
ja: WinLIRCクライアントスクリプトにより、手持ちのリモコンからの信号に応答します。

source: Restores the eject feature of the specified drive.
ja: 指定したドライブのイジェクト機能を復活させます。

source: Restores the window to its original/default display area.
ja: ウィンドウを元の/デフォルトの表示領域に戻す。

source: Results may be less than ideal if it has not.
ja: そうでない場合、結果は理想的とは言えないかもしれない。

source: Retracts (closes) the tray of the first CD/DVD drive.
ja: 1台目のCD/DVDドライブのトレイを収納する（閉じる）。

source: Retracts the tray of the specified CD/DVD drive.
ja: 指定したCD/DVDドライブのトレイを収納します。

source: Retrieval methods:
ja: 検索方法：

source: Retrieval of the AutoHotkey installation directory, which is used by A_AhkPath in compiled scripts and may be used to launch Window Spy or the help file.
ja: AutoHotkeyのインストールディレクトリの取得。コンパイルされたスクリプトでA_AhkPathによって使用され、Window Spyまたはヘルプファイルを起動するために使用されます。

source: Retrieve an item (or array element):
ja: 項目（または配列要素）を取得します：

source: Retrieve an item, where Key is a variable or expression:
ja: 項目を取得する。Keyは 変数または式：

source: Retrieve or set a property literally named Property:
ja: 文字どおりPropertyという名前のプロパティを取得または設定します：

source: Retrieve or set a property where the name is determined by evaluating an expression or variable:
ja: 式または変数の評価によって名前が決定されるプロパティを取得または設定します：

source: Retrieve or set an Object's capacity to contain properties.
ja: プロパティを含む Object の容量を取得または設定する。

source: Retrieve the number of own properties contained by an object.
ja: オブジェクトに含まれる自身のプロパティの数を取得する。

source: Retrieve the path of the desktop's current wallpaper.
ja: デスクトップの現在の壁紙のパスを取得します。

source: Retrieve the physical state (i.e. whether the user is physically holding it down).
ja: 物理的な状態（ユーザーが物理的に押さえているかどうか）を取得します。

source: Retrieve the toggle state.
ja: トグル状態を取得します。

source: Retrieves a list of running processes via DllCall then shows them in a message box.
ja: DllCallで実行中のプロセスのリストを取得し、メッセージボックスに表示します。

source: Retrieves a list of running processes via COM. For Win32_Process, see Microsoft Docs.
ja: COM経由で実行中のプロセスのリストを取得する。Win32_Process については、Microsoft Docsを参照してください。

source: Retrieves a mute setting of a sound device.
ja: サウンドデバイスのミュート設定を取得します。

source: Retrieves a native COM interface of a sound device or component.
ja: サウンドデバイスまたはコンポーネントのネイティブCOMインタフェースを取得します。

source: Retrieves a non-zero value if the file pointer has reached the end of the file, otherwise zero.
ja: ファイルポインタがファイルの末尾に到達している場合は0以外の値を、そうでない場合は0を取得します。

source: Retrieves a non-zero value if the file pointer has reached the end of the file.
ja: ファイルポインタがファイルの末尾に達した場合、非ゼロ値を取得します。

source: Retrieves a registered COM object.
ja: 登録されているCOMオブジェクトを取得します。

source: Retrieves a substring from the beginning and end of a string.
ja: 文字列の先頭と末尾から部分文字列を取り出す。

source: Retrieves a substring with a length of 3 characters at position 4.
ja: 長さ 3 文字の部分文字列を位置 4 で取得する。

source: Retrieves a system file handle, intended for use with DllCall.
ja: DllCallで使用することを目的としたシステムファイルハンドルを取得することができます。

source: Retrieves a volume setting of a sound device.
ja: サウンドデバイスの音量設定を取得します。

source: Retrieves an environment variable and stores its value in LogonServer.
ja: 環境変数を取得し、その値をLogonServerに格納します。

source: Retrieves an environment variable.
ja: 環境変数を取得します。

source: Retrieves an object's base object.
ja: オブジェクトのベースオブジェクトを取得します。

source: Retrieves and analyzes the text from the first part of a status bar.
ja: ステータスバーの最初の部分からテキストを取得して分析する。

source: Retrieves and reports information about the GetMethod method.
ja: GetMethod メソッドに関する情報を取得し、報告します。

source: Retrieves and reports the English name of Esc.
ja: Escの英語名を取得し、報告します。

source: Retrieves and reports the class name of the active window.
ja: アクティブウィンドウのクラス名を取得して報告します。

source: Retrieves and reports the count of how many characters are in a string.
ja: 文字列の文字数を取得して返します。

source: Retrieves and reports the current text from the main window's edit control.
ja: メインウィンドウのエディットコントロールから現在のテキストを取得し、報告します。

source: Retrieves and reports the exact type of the values stored in a, b and c.
ja: a、b、cに格納されている値の正確な型を取得し、報告します。

source: Retrieves and reports the free disk space of the drive which contains A_MyDocuments.
ja: A_MyDocumentsが入っているドライブのディスクの空き容量を取得し、報告します。

source: Retrieves and reports the hexadecimal scan code of the left Ctrl.
ja: 左Ctrlの16進数スキャンコードを取得し報告します。

source: Retrieves and reports the hexadecimal virtual key code of Esc.
ja: Escの仮想キーコードを16進数で取得し報告します。

source: Retrieves and reports the master volume.
ja: マスターボリュームを取得し、報告する。

source: Retrieves and reports the microphone listening volume.
ja: マイクのリスニング音量を取得し、報告する。

source: Retrieves and reports the microphone recording volume.
ja: マイクの録音音量を取得し、報告する。

source: Retrieves and reports the name of the default playback device.
ja: デフォルトの再生デバイス名を取得し、報告します。

source: Retrieves and reports the name of the first component.
ja: 最初のコンポーネントの名前を取得して報告する。

source: Retrieves and reports the name of the first device.
ja: 最初のデバイスの名前を取得し、報告します。

source: Retrieves and reports the path of the "Program Files" directory.
ja: Program Filesディレクトリのパスを取得して返します。

source: Retrieves and reports the path of the current user's Local AppData directory.
ja: 現在のユーザーのLocalAppDataディレクトリのパスを取得して返します。

source: Retrieves and reports the position and size of the calculator's client area.
ja: 電卓のクライアント領域の位置とサイズを取得して報告します。

source: Retrieves and reports the position and size of the calculator.
ja: 電卓の位置とサイズを取得し、報告します。

source: Retrieves and reports the position of the active window's client area.
ja: アクティブウィンドウのクライアント領域の位置を取得して報告します。

source: Retrieves and reports the position of the active window.
ja: アクティブウィンドウの位置を取得し、報告します。

source: Retrieves and reports the system's IPv4 addresses.
ja: システムのIPv4アドレスを取得し、報告する。

source: Retrieves and reports the title of the active window.
ja: アクティブウィンドウのタイトルを取得し、報告する。

source: Retrieves and reports the unique ID (HWND) of the active window.
ja: アクティブウィンドウのユニークID（HWND）を取得し、報告します。

source: Retrieves dimensions of system objects, and other system properties.
ja: システムオブジェクトの寸法、およびその他のシステムプロパティを取得します。

source: Retrieves file names sorted by modification date.
ja: ファイル名を更新日順に並べたものを取得します。

source: Retrieves file names sorted by name (see next example to sort by date).
ja: ファイル名を名前でソートして取得します（日付でソートする場合は次の例を参照してください）。

source: Retrieves information about a shortcut (.lnk) file, such as its target file.
ja: ショートカット（.lnk）ファイルの対象ファイルなどの情報を取得します。

source: Retrieves one or more characters from the specified position in a string.
ja: 文字列の指定された位置から、1文字または複数文字を取得します。

source: Retrieves or changes flags which control a COM wrapper object's behaviour.
ja: COMラッパーオブジェクトの動作を制御するフラグを取得または変更します。

source: Retrieves or modifies the global setting which controls whether mouse clicks reset the hotstring recognizer, as described here.
ja: マウスクリックでホットストリング認識機能がリセットされるかどうかを制御するグローバル設定を取得または変更します（ここで説明）。

source: Retrieves or modifies the set of characters used as ending characters by the hotstring recognizer.
ja: ホットストリングレコグナイザーで終端文字として使用される文字のセットを取得または変更します。

source: Retrieves or sets a custom name for the GUI window.
ja: GUIウィンドウのカスタムネームを取得または設定します。

source: Retrieves or sets a custom name for the window.
ja: ウィンドウのカスタムネームを取得または設定します。

source: Retrieves or sets a map's case sensitivity setting.
ja: マップの大文字と小文字の区別の設定を取得または設定します。

source: Retrieves or sets an object's base object.
ja: オブジェクトのベースオブジェクトを取得または設定する。

source: Retrieves or sets new contents into a value-capable control.
ja: 値付け可能なコントロールに新しいコンテンツを取得または設定します。

source: Retrieves or sets the function object which is called after a character is added to the input buffer.
ja: 入力バッファに文字が追加された後に呼び出される関数オブジェクトを取得または設定します。

source: Retrieves or sets the function object which is called when Input is terminated.
ja: Input終了時に呼び出される関数オブジェクトを取得または設定します。

source: Retrieves or sets the function object which is called when a notification-enabled key is pressed.
ja: 通知可能なキーが押されたときに呼び出される関数オブジェクトを取得または設定します。

source: Retrieves or sets the function object which is called when a notification-enabled key is released.
ja: 通知可能なキーがリリースされたときに呼び出される関数オブジェクトを取得または設定します。

source: Retrieves or sets the GUI's title.
ja: GUI のタイトルを取得または設定します。

source: Retrieves or sets the background color of the window.
ja: ウィンドウの背景色を取得または設定します。

source: Retrieves or sets the buffer's size, in bytes.
ja: バッファのサイズをバイト単位で取得または設定します。

source: Retrieves or sets the contents of a control.
ja: コントロールの内容を取得または設定します。

source: Retrieves or sets the current capacity of a map.
ja: マップの現在の容量を取得または設定します。

source: Retrieves or sets the current capacity of an array.
ja: 配列の現在の容量を取得または設定します。

source: Retrieves or sets the current position of the file pointer.
ja: ファイルポインタの現在位置を取得または設定します。

source: Retrieves or sets the default menu item.
ja: デフォルトのメニュー項目を取得または設定します。

source: Retrieves or sets the explicit name of the control.
ja: コントロールの明示的な名前を取得または設定します。

source: Retrieves or sets the length of an array.
ja: 配列の長さを取得または設定します。

source: Retrieves or sets the minimum send level of input to collect.
ja: 収集する入力の最小送信レベルを取得または設定します。

source: Retrieves or sets the name of the control.
ja: コントロールの名前を取得または設定します。

source: Retrieves or sets the number of clicks required to activate the tray menu's default item.
ja: トレイメニューのデフォルト項目を有効にするために必要なクリック数を取得または設定します。

source: Retrieves or sets the object on which all instances of the class are based.
ja: クラスのすべてのインスタンスの基となるオブジェクトを取得または設定します。

source: Retrieves or sets the position of the file pointer.
ja: ファイルポインタの位置を取得または設定します。

source: Retrieves or sets the size of horizontal margins between sides and subsequently created controls.
ja: 側面とその後に作成されるコントロールの間の水平マージンのサイズを取得または設定します。

source: Retrieves or sets the size of the file.
ja: ファイルサイズを取得または設定します。

source: Retrieves or sets the size of vertical margins between sides and subsequently created controls.
ja: 側面とその後に作成されるコントロールの間の垂直マージンのサイズを取得または設定します。

source: Retrieves or sets the text encoding used by this file object.
ja: このファイルオブジェクトが使用するテキストエンコーディングを取得または設定します。

source: Retrieves or sets the text/caption of the control.
ja: コントロールのテキスト/キャプションを取得または設定します。

source: Retrieves or sets the timeout value in seconds.
ja: タイムアウト値を秒単位で取得または設定します。

source: Retrieves or sets the value of a key-value pair.
ja: キーと値のペアの値を取得または設定します。

source: Retrieves or sets the value of an array element.
ja: 配列の要素の値を取得または設定します。

source: Retrieves or sets the window's menu bar.
ja: ウィンドウのメニューバーを取得または設定します。

source: Retrieves substrings (fields) from a string, one at a time.
ja: 文字列から部分文字列（フィールド）を1つずつ取得します。

source: Retrieves text from a control.
ja: コントロールからテキストを取得します。

source: Retrieves the Gui object of a GUI window associated with the specified HWND.
ja: 指定された HWND に関連付けられた GUI ウィンドウのGui オブジェクトを取得します。

source: Retrieves the Gui object of a GUI window associated with the specified window handle.
ja: 指定されたウィンドウハンドルに関連付けられているGUIウィンドウのGuiオブジェクトを取得します。

source: Retrieves the Gui object of the control's parent GUI window.
ja: コントロールの親GUIウィンドウのGuiオブジェクトを取得します。

source: Retrieves the Gui object of the control's parent window.
ja: コントロールの親ウィンドウのGuiオブジェクトを取得します。

source: Retrieves the GuiControl object associated with the specified name, text, ClassNN or HWND.
ja: 指定された名前、テキスト、ClassNN、HWND に関連するGuiControl オブジェクトを取得します。

source: Retrieves the GuiControl object of a GUI control associated with the specified HWND.
ja: 指定された HWND に関連付けられた GUI コントロールのGuiControl オブジェクトを取得します。

source: Retrieves the GuiControl object of a GUI control associated with the specified window handle.
ja: 指定されたウィンドウハンドルに関連付けられているGUIコントロールのGuiControlオブジェクトを取得します。
